<a href="https://colab.research.google.com/github/LaiseLopes/Python/blob/master/Aula_1_Python_Apend.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [13]:
import pandas as pd
import matplotlib.pyplot as plt
import statsmodels.api as sm

/usr/local/lib/python3.6/dist-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

In [4]:
apend_a = pd.read_excel("/content/Apend_A.xlsx")
apend_a.head()

   id     nome  idade lazer
0   1    Edmar     33   sim
1   2    Ivone     40   não
2   3  Adriana     41   não
3   4    Maria     46   sim
4   5    Pedro     29   sim

In [5]:
apend_b = pd.read_excel("/content/Apend_B.xlsx")
apend_b.head()

   id  salario   escolaridade
0   1     1000            MBA
1   2     2000       Mestrado
2   3     1500      Doutorado
3   6     1800      Graduação
4   7     2100  Pós_Graduação

In [6]:
consolidado = pd.merge(apend_a,apend_b, on = 'id')
consolidado.head()

   id     nome  idade lazer  salario escolaridade
0   1    Edmar     33   sim     1000          MBA
1   2    Ivone     40   não     2000     Mestrado
2   3  Adriana     41   não     1500    Doutorado

In [7]:
# right
consolidado1 = pd.merge(apend_a,apend_b, on = 'id', how = 'right')
consolidado1.head()

   id     nome  idade lazer  salario   escolaridade
0   1    Edmar   33.0   sim     1000            MBA
1   2    Ivone   40.0   não     2000       Mestrado
2   3  Adriana   41.0   não     1500      Doutorado
3   6      NaN    NaN   NaN     1800      Graduação
4   7      NaN    NaN   NaN     2100  Pós_Graduação

In [8]:
#left
consolidado2 = pd.merge(apend_a,apend_b, on = 'id', how = 'left')
consolidado2

   id     nome  idade lazer  salario escolaridade
0   1    Edmar     33   sim   1000.0          MBA
1   2    Ivone     40   não   2000.0     Mestrado
2   3  Adriana     41   não   1500.0    Doutorado
3   4    Maria     46   sim      NaN          NaN
4   5    Pedro     29   sim      NaN          NaN

In [9]:
#full
consolidado3 = pd.merge(apend_a,apend_b, on = 'id', how = 'outer')
consolidado3

   id     nome  idade lazer  salario   escolaridade
0   1    Edmar   33.0   sim   1000.0            MBA
1   2    Ivone   40.0   não   2000.0       Mestrado
2   3  Adriana   41.0   não   1500.0      Doutorado
3   4    Maria   46.0   sim      NaN            NaN
4   5    Pedro   29.0   sim      NaN            NaN
5   6      NaN    NaN   NaN   1800.0      Graduação
6   7      NaN    NaN   NaN   2100.0  Pós_Graduação

In [10]:
apend_1 = pd.read_excel("/content/Apend_1.xlsx")
apend_1

   id     Nome  Idade
0   1    Edmar     33
1   2    Ivone     40
2   3  Adriana     41
3   4    Maria     46
4   5    Pedro     29

In [11]:
apend_2 = pd.read_excel("/content/Apend_2.xlsx")
apend_2

   id       Nome  Idade
0   1    Matheus     35
1   2     Jasmim     29
2   3  Conceição     23
3   4    Ricardo     41
4   5  Ana Paula     18

In [12]:
consolidado4 = pd.concat([apend_1, apend_2])
consolidado4

   id       Nome  Idade
0   1      Edmar     33
1   2      Ivone     40
2   3    Adriana     41
3   4      Maria     46
4   5      Pedro     29
0   1    Matheus     35
1   2     Jasmim     29
2   3  Conceição     23
3   4    Ricardo     41
4   5  Ana Paula     18

In [28]:
consolidado5 = consolidado3.dropna()
consolidado5.head()

   id     nome  idade lazer  salario escolaridade
0   1    Edmar   33.0   sim   1000.0          MBA
1   2    Ivone   40.0   não   2000.0     Mestrado
2   3  Adriana   41.0   não   1500.0    Doutorado

In [20]:
consolidado.describe().salario

count       3.0
mean     1500.0
std       500.0
min      1000.0
25%      1250.0
50%      1500.0
75%      1750.0
max      2000.0
Name: salario, dtype: float64